{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Report describing a feature update improving the Celebration page’s autoplay‑blocked audio prompt.",
  "frontend-file-summaries.txt": "Text file containing human‑written summaries of all frontend files.",
  "frontend/index.css": "Tailwind base theme variables and global styles defining light/dark color tokens.",
  "frontend/index.html": "HTML entry point mounting the React root and loading main.tsx.",
  "frontend/src/App.tsx": "Root component switching between proposal, celebration, and future‑family pages.",
  "frontend/src/components/GlassOverlay.tsx": "Glassmorphism container component wrapping children with blur and rounded styles.",
  "frontend/src/content/celebrationMessage.ts": "Exports the long celebration message string shown on the Celebration page.",
  "frontend/src/content/uploadedMedia.ts": "Lists image asset paths and exports the celebration audio file path.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing on identity changes.",
  "frontend/src/hooks/useAutoplayAudio.ts": "Manages autoplay audio logic, detecting policy blocks vs real load/play errors and exposing retry controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, clear, and identity‑loading behavior.",
  "frontend/src/hooks/useSlideshowSequence.ts": "Controls timed image‑sequence progression and signals when the slideshow completes.",
  "frontend/src/index.css": "Global Tailwind styles, color variables, fonts, and custom animations used across the UI.",
  "frontend/src/main.tsx": "App bootstrap creating React root and wrapping the app with React Query and Internet Identity providers.",
  "frontend/src/pages/CelebrationPage.tsx": "Runs an image slideshow with audio autoplay handling, then transitions to a grid display with overlays and a continue action.",
  "frontend/src/pages/FutureFamilyPage.tsx": "Shows a generated family image with a caption and footer linking to caffeine.ai.",
  "frontend/src/pages/ProposalPage.tsx": "Displays a proposal prompt with a stationary Yes button and a No button that moves randomly or transforms based on user interaction.",
  "frontend/src/utils/positioning.ts": "Provides functions to get random on‑screen positions and detect overlap between rectangles with padding.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, plugins, custom colors, fonts, shadows, and animations.",
  "project_state.json": "Defines project metadata, requirements, architecture notes, and known issues for the Valentine website flow."
}