{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Clearer Celebration autoplay-blocked prompt + ensure generated audio asset is used",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Make the Celebration page’s autoplay-blocked overlay more explicit and reassuring, keep it visible until playback starts or an error occurs, and ensure the generated MP3 is the audio source.",
      "acceptanceCriteria": [
        "When the browser blocks autoplay, the Celebration page shows a clear on-screen prompt instructing the user to tap a button to start the music.",
        "The prompt remains visible until the user successfully starts playback or an audio load/play error is detected.",
        "All user-facing strings added or changed for this prompt are in English.",
        "The existing Play Music action still triggers audio playback via the existing handler (no regressions to the current flow)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CelebrationPage.tsx",
          "operation": "modify",
          "description": "Update the autoplay-blocked overlay copy to be more explicit/reassuring (English-only) about why music didn’t start and that tapping the button will start it; ensure the overlay’s visibility logic matches the requirement (stays up until playback succeeds or an error state is present). Continue using the existing shadcn-ui Button for the action and the existing play handler; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAutoplayAudio.ts",
          "operation": "modify",
          "description": "Refine autoplay/play error classification so true audio support/loading failures surface as an error state (so the blocked prompt does not mask an actual failure), while genuine autoplay permission blocks keep the blocked state until the user initiates playback; preserve the existing play() handler behavior for the Play Music action."
        },
        {
          "path": "frontend/src/content/uploadedMedia.ts",
          "operation": "modify",
          "description": "Verify the audioFile constant references the intended generated MP3 under frontend/public/assets/generated and adjust only if it does not match the actual asset location/name; keep static media referenced directly from the public generated assets folder."
        },
        {
          "path": "frontend/public/assets/generated/AUD-20240215-WA0010.mp3",
          "operation": "create",
          "description": "Add the required MP3 audio asset at this exact path so the Celebration page can load it directly from static public assets (no backend proxying)."
        }
      ]
    }
  ]
}